In [1]:
# pandas

DataFrame

In [2]:
import pandas as pd

In [3]:
d=pd.DataFrame()

In [5]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [6]:
type(d)

pandas.core.frame.DataFrame

In [7]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [8]:
data=[['abc',1],['def',2],['ghi',3],['','jkl'],['mno','a']]
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'jkl'], ['mno', 'a']]

In [9]:
d1=pd.DataFrame(data)

In [10]:
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       jkl
4  mno    a

In [13]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C',"D",'E'])

In [14]:
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       jkl
E  mno    a

In [15]:
# dataFrame using Dictionary

In [17]:
data={'name':['a','b','c','d'],'age':[21,25,19,22]}
a=pd.DataFrame(data)
a

  name  age
0    a   21
1    b   25
2    c   19
3    d   22

In [22]:
a.rename({'name':'candidate','age':'age_years'},axis=1,inplace=True)
a

  candidate  age_years
0         a         21
1         b         25
2         c         19
3         d         22

In [24]:
a.rename({'name':'candidate','age':'age_years'})
a

  candidate  age_years
0         a         21
1         b         25
2         c         19
3         d         22

In [26]:
data2=[['Anand',19,'Maths'],['Shrushti',20,'Maths'],['Gandhrav',17,'Maths'],["Srujan",18,'Maths']]
data2

[['Anand', 19, 'Maths'],
 ['Shrushti', 20, 'Maths'],
 ['Gandhrav', 17, 'Maths'],
 ['Srujan', 18, 'Maths']]

In [27]:
a=pd.DataFrame(data2)
a

          0   1      2
0     Anand  19  Maths
1  Shrushti  20  Maths
2  Gandhrav  17  Maths
3    Srujan  18  Maths

In [30]:
data2[1][0]

'Shrushti'

In [31]:
data2[2]

['Gandhrav', 17, 'Maths']

In [32]:
data2[3][0]='Abhinav'
data2

[['Anand', 19, 'Maths'],
 ['Shrushti', 20, 'Maths'],
 ['Gandhrav', 17, 'Maths'],
 ['Abhinav', 18, 'Maths']]

In [33]:
a=pd.DataFrame(data2,columns=['Name','Marks','Subject'])
a

       Name  Marks Subject
0     Anand     19   Maths
1  Shrushti     20   Maths
2  Gandhrav     17   Maths
3   Abhinav     18   Maths

In [37]:
a.iloc[1,1]      ## iloc: is used in DataFrame for indexing

20

In [38]:
a.iloc[0,0]

'Anand'

In [39]:
a.iloc[2,2]

'Maths'